#+title: Data Structures and Algorithms
#+author: Lokesh Mohanty
#+instructor: Chiraj Jain

* Closest pair of points

# Linear time bounds for median computations

#+begin_src C++ :results verbatim
  #include <iostream>
  #include <utility>

  using namespace std;

  pair<pair<int,  int>, pair<int,  int>> closest_pair(pair<int, int> a[], int n) {
    return make_pair(a[0], a[1]);
  }

  int main() {
    int n = 5;
    pair<int, int> a[n];
    a[0] = make_pair(0,1);
    a[1] = make_pair(0,2);
    a[2] = make_pair(2,3);
    a[3] = make_pair(2,4);
    a[4] = make_pair(5,1);
    pair<pair<int,int>,pair<int,int>> closest = closest_pair(a, n);
    cout << "(" << closest.first.first << ", " << closest.first.second << ")" << endl;
    cout << "(" << closest.second.first << ", " << closest.second.second << ")" << endl;
    return 0;
  }
#+end_src

#+RESULTS:
: (0, 1)
: (0, 1)

